socialNetwork/jaeger_traces/limit_socnetapp_social-graph-service/traces_0.5.log
Running 30s test @ http://ms1311.utah.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 13.151ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 12.652ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 13.474ms, rate sampling interval: 39ms
  Thread calibration: mean lat.: 13.026ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 12.911ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 13.638ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 12.585ms, rate sampling interval: 35ms
  Thread calibration: mean lat.: 13.126ms, rate sampling interval: 37ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://ms1311.utah.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.09ms    4.58ms  28.11ms   71.36%
    Req/Sec    24.55     26.64   111.00     80.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.48ms
 75.000%   16.75ms
 90.000%   19.98ms
 99.000%   28.11ms
 99.900%   34.21ms
 99.990%   42.85ms
 99.999%   42.85ms
100.000%   42.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.183     0.000000            1         1.00
       9.111     0.100000          390         1.11
      10.071     0.200000          780         1.25
      10.983     0.300000         1170         1.43
      12.167     0.400000         1560         1.67
      13.479     0.500000         1949         2.00
      14.127     0.550000         2146         2.22
      14.727     0.600000         2341         2.50
      15.343     0.650000         2537         2.86
      16.007     0.700000         2729         3.33
      16.751     0.750000         2926         4.00
      17.135     0.775000         3021         4.44
      17.647     0.800000         3118         5.00
      18.095     0.825000         3217         5.71
      18.671     0.850000         3314         6.67
      19.247     0.875000         3411         8.00
      19.567     0.887500         3459         8.89
      19.999     0.900000         3508        10.00
      20.399     0.912500         3559        11.43
      20.879     0.925000         3605        13.33
      21.535     0.937500         3654        16.00
      21.919     0.943750         3679        17.78
      22.287     0.950000         3703        20.00
      22.815     0.956250         3727        22.86
      23.727     0.962500         3751        26.67
      24.255     0.968750         3776        32.00
      24.671     0.971875         3788        35.56
      25.071     0.975000         3801        40.00
      25.631     0.978125         3812        45.71
      25.903     0.981250         3824        53.33
      27.007     0.984375         3837        64.00
      27.087     0.985938         3843        71.11
      27.327     0.987500         3849        80.00
      27.887     0.989062         3855        91.43
      28.207     0.990625         3861       106.67
      28.607     0.992188         3867       128.00
      29.183     0.992969         3870       142.22
      29.455     0.993750         3873       160.00
      29.695     0.994531         3876       182.86
      30.207     0.995313         3879       213.33
      31.087     0.996094         3882       256.00
      31.519     0.996484         3884       284.44
      31.615     0.996875         3885       320.00
      31.711     0.997266         3887       365.71
      32.415     0.997656         3888       426.67
      32.639     0.998047         3890       512.00
      33.375     0.998242         3891       568.89
      33.375     0.998437         3891       640.00
      33.439     0.998633         3892       731.43
      34.207     0.998828         3893       853.33
      35.871     0.999023         3894      1024.00
      35.871     0.999121         3894      1137.78
      35.871     0.999219         3894      1280.00
      36.799     0.999316         3895      1462.86
      36.799     0.999414         3895      1706.67
      40.287     0.999512         3896      2048.00
      40.287     0.999561         3896      2275.56
      40.287     0.999609         3896      2560.00
      40.287     0.999658         3896      2925.71
      40.287     0.999707         3896      3413.33
      42.847     0.999756         3897      4096.00
      42.847     1.000000         3897          inf
#[Mean    =       14.089, StdDeviation   =        4.579]
#[Max     =       42.816, Total count    =         3897]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5818 requests in 30.11s, 1.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 9508
Requests/sec:    193.22  
Transfer/sec:     40.57KB