socialNetwork/jaeger_traces/limit_socnetapp_social-graph-service/traces_socnetapp_social-graph-service_0.4.log
Running 30s test @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 373.315ms, rate sampling interval: 1400ms
  Thread calibration: mean lat.: 334.909ms, rate sampling interval: 1518ms
  Thread calibration: mean lat.: 528.884ms, rate sampling interval: 1736ms
  Thread calibration: mean lat.: 426.402ms, rate sampling interval: 1786ms
  Thread calibration: mean lat.: 600.961ms, rate sampling interval: 1924ms
  Thread calibration: mean lat.: 480.170ms, rate sampling interval: 1980ms
  Thread calibration: mean lat.: 472.759ms, rate sampling interval: 2004ms
  Thread calibration: mean lat.: 394.382ms, rate sampling interval: 1499ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.96s     3.70s   10.00s    75.42%
    Req/Sec    19.48      4.55    31.00     81.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  566.27ms
 75.000%    6.59s 
 90.000%    9.26s 
 99.000%   10.00s 
 99.900%   15.50s 
 99.990%   18.79s 
 99.999%   18.79s 
100.000%   18.79s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.705     0.000000            1         1.00
     105.023     0.100000          316         1.11
     179.839     0.200000          630         1.25
     253.567     0.300000          945         1.43
     358.143     0.400000         1260         1.67
     566.271     0.500000         1575         2.00
     782.335     0.550000         1732         2.22
    1165.311     0.600000         1890         2.50
    2566.143     0.650000         2047         2.86
    4771.839     0.700000         2205         3.33
    6586.367     0.750000         2363         4.00
    7086.079     0.775000         2441         4.44
    7745.535     0.800000         2521         5.00
    8269.823     0.825000         2598         5.71
    8749.055     0.850000         2677         6.67
    9019.391     0.875000         2760         8.00
    9117.695     0.887500         2798         8.89
    9265.151     0.900000         2838        10.00
    9404.415     0.912500         2874        11.43
    9641.983     0.925000         2914        13.33
    9814.015     0.937500         2953        16.00
    9879.551     0.943750         2974        17.78
    9920.511     0.950000         2999        20.00
    9945.087     0.956250         3014        22.86
    9977.855     0.962500         3031        26.67
   10002.431     0.968750         3128        32.00
   10002.431     0.971875         3128        35.56
   10002.431     0.975000         3128        40.00
   10002.431     0.978125         3128        45.71
   10002.431     0.981250         3128        53.33
   10002.431     0.984375         3128        64.00
   10002.431     0.985938         3128        71.11
   10002.431     0.987500         3128        80.00
   10002.431     0.989062         3128        91.43
   10002.431     0.990625         3128       106.67
   10002.431     0.992188         3128       128.00
   10002.431     0.992969         3128       142.22
   10010.623     0.993750         3141       160.00
   10010.623     0.994531         3141       182.86
   10010.623     0.995313         3141       213.33
   10010.623     0.996094         3141       256.00
   10010.623     0.996484         3141       284.44
   10010.623     0.996875         3141       320.00
   10010.623     0.997266         3141       365.71
   10084.351     0.997656         3142       426.67
   10190.847     0.998047         3143       512.00
   10313.727     0.998242         3144       568.89
   12443.647     0.998437         3145       640.00
   12443.647     0.998633         3145       731.43
   15499.263     0.998828         3146       853.33
   15499.263     0.999023         3146      1024.00
   15548.415     0.999121         3147      1137.78
   15548.415     0.999219         3147      1280.00
   15548.415     0.999316         3147      1462.86
   16236.543     0.999414         3148      1706.67
   16236.543     0.999512         3148      2048.00
   16236.543     0.999561         3148      2275.56
   16236.543     0.999609         3148      2560.00
   16236.543     0.999658         3148      2925.71
   18792.447     0.999707         3149      3413.33
   18792.447     1.000000         3149          inf
#[Mean    =     2962.899, StdDeviation   =     3701.079]
#[Max     =    18776.064, Total count    =         3149]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  4761 requests in 30.10s, 0.99MB read
  Socket errors: connect 0, read 0, write 0, timeout 9456
  Non-2xx or 3xx responses: 105
Requests/sec:    158.15  
Transfer/sec:     33.55KB